app/views/users/show.html.erb

  <tbody>
    <% @user.debit_accounts.each do |account| %>
---
SELECT "debit_accounts".* FROM "debit_accounts" WHERE "debit_accounts"."user_id" = $1  [["user_id", 2]]

  <tbody>
    <% @user.checking_accounts.each do |account| %>
---
SELECT "checking_accounts".* FROM "checking_accounts" WHERE "checking_accounts"."user_id" = $1  [["user_id", 2]]

  <tbody>
    <% @user.credit_accounts.each do |account| %>
---
SELECT "credit_accounts".* FROM "credit_accounts" WHERE "credit_accounts"."user_id" = $1  [["user_id", 2]]