app/controllers/checking_accounts_controller.rb

INSERT INTO "checking_accounts" ("currency", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["currency", "CLP"], ["created_at", "2020-11-27 20:38:54.732539"], ["updated_at", "2020-11-27 20:38:54.732539"], ["user_id", 7]]
---
  def create
    @account = CheckingAccount.new(account_params)
    @account.user = @user
    if @account.save

SELECT "checking_accounts".* FROM "checking_accounts" WHERE "checking_accounts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def require_ownership_permission
    @account = CheckingAccount.find(params[:id])