app/controllers/credit_accounts_controller.rb

  def create
    @account = CreditAccount.new(account_params)
    @account.user = @user
    if @account.save
---
INSERT INTO "credit_accounts" ("currency", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["currency", "CLP"], ["created_at", "2020-10-15 00:39:30.204713"], ["updated_at", "2020-10-15 00:39:30.204713"], ["user_id", 1]]

  def require_ownership_permission
    @account = CreditAccount.find(params[:id])
---
SELECT "credit_accounts".* FROM "credit_accounts" WHERE "credit_accounts"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]