app/controllers/debit_accounts_controller.rb

  def create
    @account = DebitAccount.new(account_params)
    @account.user = @user
    if @account.save
---
INSERT INTO "debit_accounts" ("currency", "liquid_balance", "user_id") VALUES ($1, $2, $3) RETURNING "id"  [["currency", "CLP"], ["liquid_balance", 50000], ["user_id", 7]]

  def require_ownership_permission
    @account = DebitAccount.find(params[:id])
---
SELECT "debit_accounts".* FROM "debit_accounts" WHERE "debit_accounts"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]