app/controllers/transactions_controller.rb

  def set_user
    @user = User.find(params[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 2], ["LIMIT", 1]]

  def save_and_redirect
    if @account.valid? && @transaction.valid?
      @account.save
      @transaction.save
---
INSERT INTO "transactions" ("currency", "origin_id", "description", "amount", "category_id", "created_at", "updated_at", "origin_type") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def assign_installments
    unit_amount = @transaction.amount.abs / @transaction.installments_qty
    module_div_amount = @transaction.amount.abs % @transaction.installments_qty
    ins = nil
    (1..@transaction.installments_qty).each do |quota_i|
      ins = Installment.create(place: quota_i, unit_amount: unit_amount,
                               liq_date: (30 * quota_i).days.from_now,
                               total_amount: @transaction.amount,
                               total_places: @transaction.installments_qty)
      @transaction.installments << ins
---
INSERT INTO "installments" ("place", "total_places", "unit_amount", "total_amount", "liq_date", "transaction_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def set_account
    if params.key?('debit_account_id')
      @account_type = :debit_account
      @account = DebitAccount.find(params[:debit_account_id])

    elsif params.key?('credit_account_id')
      @account_type = :credit_account
      @account = CreditAccount.find(params[:credit_account_id])

    else # params.key?('checking_account_id') #there's no option due to routing
      @account_type = :checking_account
      @account = CheckingAccount.find(params[:checking_account_id])
---
SELECT "debit_accounts".* FROM "debit_accounts" WHERE "debit_accounts"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
SELECT "credit_accounts".* FROM "credit_accounts" WHERE "credit_accounts"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
SELECT "debit_accounts".* FROM "debit_accounts" WHERE "debit_accounts"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
SELECT "checking_accounts".* FROM "checking_accounts" WHERE "checking_accounts"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]

  def set_transfer_params
    @other_account = nil
    case params[@account_type][:destination_account_type]
    when 'Debito'
      @other_account = DebitAccount
                       .find_by(id:
                        params[@account_type][:destination_account_id])

    when 'Credito'
      @other_account = CreditAccount
                       .find_by(id:
                        params[@account_type][:destination_account_id])

    else # Corriente
      @other_account = CheckingAccount
                       .find_by(id:
                        params[@account_type][:destination_account_id])
    end
    return nil unless @other_account

    @category = Category
                .find_by(id: params[@account_type][:category].to_i)
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]

  def transaction_params
    @category = Category.find_by(id: params[:transaction][:category].to_i)
---
SELECT "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]