app/controllers/users_controller.rb

  def update
    if @user.update(user_params)
---
UPDATE "users" SET "encrypted_password" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["encrypted_password", "$2a$12$RmNQb.cvmgdLZ056TPRY3euXIKhgYOBIEfzu2iitZU1Ixm3gONFzK"], ["updated_at", "2020-12-02 19:02:03.468934"], ["id", 2]]